#ifndef ESP8266_H_
#define ESP8266_H_

#include <msp430x14x.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>

#define CPU_F ((double)8000000)
#define delay_us(x) __delay_cycles((long)(CPU_F*(double)x/1000000.0))
#define delay_ms(x) __delay_cycles((long)(CPU_F*(double)x/1000.0))

/***************************************************************************
函数名称：ESP8266_AT_Init
功        能：对ESP8266进行设置
参        数：无
返  回  值：
****************************************************************************/
void ESP8266_AT_Init(void);

/***************************************************************************
函数名称： ESP8266_AT_RST
功        能：重启通信模块
参        数：无
返  回  值：
****************************************************************************/
void ESP8266_AT_RST(void);

/***************************************************************************
函数名称：ESP8266_Test_AT_OK
功        能：向ESP8266模块发送AT
参        数：无
返  回  值：
****************************************************************************/
void ESP8266_Test_AT_OK(void);

/***************************************************************************
函数名称：ESP8266_Set_CIPMUX();
功        能：设置多连接模式，CIPMUX=1
参        数：无
返  回  值：
****************************************************************************/
void ESP8266_Set_CIPMUX(void);

/***************************************************************************
函数名称：ESP8266_Set_Server_Port()
功        能：设置服务器的端口，8899
参        数：无
返  回  值：OK?
****************************************************************************/
void ESP8266_Set_Server_Port(void);






#endif /*ESP8266_H_*/
